testCases/PH_test/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{

    p
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-10;
        relTol          0.05;
    }

    "(U|k|epsilon|omega|nuTilda|phit)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.05;
    }

    f
    {
        solver          PBiCGStab;
        preconditioner  DIC;
        tolerance       1e-10;
        relTol          0;
    }
}

SIMPLE
{
    residualControl
    {
        "(U|p|k|epsilon)" 1e-06;
    }
    nNonOrthogonalCorrectors 1;
	pRefCell	0;
	pRefValue		0;
    consistent          yes;
}

relaxationFactors
{
    fields
    {
        p               0.3;
    }
    equations
    {
        U               0.95;
        "(k|epsilon|omega|nuTilda|phit|f)" 0.7;
    }
}

// ************************************************************************* //
